package com.fenfen.operater;

public class Demo6 {
    //位运算
    public static void main(String[] args) {
    /*二进制
    A = 0011 1100
    B = 0000 1101

    A&B 0000 1100           每一位上进行与运算
    A|B 0011 1101           每一位上进行或运算
    A^B 0011 0001           异或 相同0 不相同为1
    ~B  1111 0010

    面试题：2*8怎么最快  2*2*2*2
    <<左移 相当于乘以2
    >>右移 相当于除以2

    0000 0000 0
    0000 0001 1
    0000 0010 2
    0000 0100 4
    0000 1000 8
    0001 0000 16

    所以2<<左移3位 就是16了
      */
        System.out.println(2<<3);
    }
}
